{"Date": "0", "Claim": "Smoking is detrimental to human health."}
{"Date": "0", "Claim": "Smoking is beneficial to human health."}
{"Date": "1600", "Claim": "Smoking tobacco is believed to cleanse the body and ward off disease."}
{"Date": "1620", "Claim": "Physicians recommend tobacco smoke as a remedy for headaches and digestive troubles."}
{"Date": "1650", "Claim": "Tobacco is praised for its calming effects; some consider it a divine gift."}
{"Date": "1700", "Claim": "Smoking is viewed as a fashionable habit among the upper class, considered harmless."}
{"Date": "1730", "Claim": "Some early critics warn that excessive smoking may weaken the body, though opinions vary widely."}
{"Date": "1750", "Claim": "Doctors still prescribe tobacco for medicinal purposes, especially for asthma-like symptoms."}
{"Date": "1780", "Claim": "Tobacco use is widespread and largely accepted as benign, even beneficial for nerves."}
{"Date": "1800", "Claim": "Smoking is increasingly seen as relaxing and a normal part of daily life."}
{"Date": "1820", "Claim": "Medical texts mention possible respiratory irritation but dismiss long-term harm."}
{"Date": "1840", "Claim": "Some European physicians express mild concern that heavy smoking could strain the lungs."}
{"Date": "1850", "Claim": "Cigars and pipes are socially respected, with no major health warnings attached."}
{"Date": "1860", "Claim": "Smoking is associated with masculinity and vigor; few consider health risks."}
{"Date": "1880", "Claim": "A handful of researchers speculate that smoking might cause throat irritation, though not serious harm."}
{"Date": "1890", "Claim": "Anti-tobacco groups begin forming, but their concerns focus on morality, not health dangers."}
{"Date": "1900", "Claim": "Early cigarette popularity grows; advertisements emphasize smoking as soothing and sophisticated."}
{"Date": "1910", "Claim": "Some doctors note a rise in lung-related issues but do not yet connect them strongly to smoking."}
{"Date": "1920", "Claim": "Cigarettes are marketed to women with claims of weight control and stress relief."}
{"Date": "1925", "Claim": "Initial scientific papers suggest a possible link between smoking and cancer, but evidence is considered inconclusive."}
{"Date": "1930", "Claim": "Medical professionals begin discussing lung cancer more often, yet many still deny smoking as a cause."}
{"Date": "1935", "Claim": "Tobacco companies fund studies that claim smoking poses minimal risk to health."}
{"Date": "1940", "Claim": "Some physicians warn patients about excessive smoking, though public awareness is low."}
{"Date": "1945", "Claim": "Postwar culture reinforces smoking as glamorous and relaxing despite murmurs of health concerns."}
{"Date": "1950", "Claim": "A major study reports a strong statistical link between smoking and lung cancer."}
{"Date": "1951", "Claim": "Public health officials begin cautiously stating that smoking may contribute to serious illnesses."}
{"Date": "1953", "Claim": "Industry-sponsored research attempts to cast doubt on new cancer findings."}
{"Date": "1954", "Claim": "Doctors' groups begin acknowledging significant evidence linking smoking to lung cancer."}
{"Date": "1957", "Claim": "The U.S. Public Health Service announces that smoking is a major cause of lung cancer in men."}
{"Date": "1960", "Claim": "Broad scientific consensus forms that smoking is dangerous, though advertising still promotes it heavily."}
{"Date": "1964", "Claim": "The U.S. Surgeon General formally declares smoking a cause of lung cancer and other diseases."}
{"Date": "1966", "Claim": "Health warnings begin appearing on cigarette packages for the first time."}
{"Date": "1970", "Claim": "More studies reveal that smoking contributes to heart disease in addition to cancer."}
{"Date": "1971", "Claim": "Television cigarette ads are banned; public concern grows."}
{"Date": "1975", "Claim": "Research suggests that secondhand smoke may pose health risks."}
{"Date": "1980", "Claim": "Smoking is widely viewed as a significant public health problem."}
{"Date": "1985", "Claim": "Secondhand smoke is increasingly recognized as harmful, especially to children."}
{"Date": "1990", "Claim": "Many countries introduce workplace smoking bans due to clear health risks."}
{"Date": "1995", "Claim": "Public education campaigns highlight smoking as a leading cause of preventable death."}
{"Date": "2000", "Claim": "The harmful effects of smoking are well-established; youth prevention programs expand."}
{"Date": "2003", "Claim": "The WHO Framework Convention on Tobacco Control emphasizes global action on smoking risks."}
{"Date": "2005", "Claim": "Smoking bans in restaurants and bars spread, supported by strong evidence of harm."}
{"Date": "2010", "Claim": "Smoking is recognized as contributing to numerous cancers beyond lung cancer, including throat and bladder cancer."}
{"Date": "2012", "Claim": "Public health organizations intensify efforts to reduce smoking rates through taxation and regulation."}
{"Date": "2015", "Claim": "Awareness grows about the dangers of smoking during pregnancy, including fetal harm."}
{"Date": "2017", "Claim": "Studies reinforce that no level of smoking is safe, even occasional use."}
{"Date": "2019", "Claim": "Global smoking rates decline as cessation programs and warnings increase."}
{"Date": "2020", "Claim": "Smoking is identified as a major risk factor for severe respiratory infections."}
{"Date": "2022", "Claim": "Health agencies highlight lifelong benefits of quitting smoking at any age."}
{"Date": "2024", "Claim": "Smoking is universally acknowledged as a leading cause of preventable disease and death worldwide."}
{"Date": "2025", "Claim": "Society broadly views smoking as harmful, with strong support for continued reduction policies."}
{"Date": "-1", "Claim": "The Earth orbits the Sun once every 365.25 days."}
{"Date": "-1", "Claim": "Water expands when it freezes due to molecular structure changes."}
{"Date": "-1", "Claim": "Many people believe pineapple belongs on pizza, though others disagree."}
{"Date": "-1", "Claim": "The Great Wall of China is not visible from the Moon with the naked eye."}
{"Date": "-1", "Claim": "Humans share roughly 98% of their DNA with chimpanzees."}
{"Date": "-1", "Claim": "Artificial intelligence will significantly change future job markets."}
{"Date": "-1", "Claim": "Mount Everest is the tallest mountain above sea level."}
{"Date": "-1", "Claim": "Democracy aims to give citizens a voice in governmental decisions."}
{"Date": "-1", "Claim": "Cats can experience a wide range of emotions, including contentment and fear."}
{"Date": "-1", "Claim": "The speed of light is approximately 299,792 kilometers per second."}
{"Date": "-1", "Claim": "Recycling can reduce the amount of waste sent to landfills."}
{"Date": "-1", "Claim": "The human brain uses about 20% of the body's energy."}
{"Date": "-1", "Claim": "Mars has the largest known volcano in the solar system, Olympus Mons."}
{"Date": "-1", "Claim": "Some people argue that school uniforms improve student focus."}
{"Date": "-1", "Claim": "Elephants are capable of recognizing themselves in mirrors."}
{"Date": "-1", "Claim": "Solar power is one of the fastest-growing energy sources in the world."}
{"Date": "-1", "Claim": "Shakespeare wrote at least 37 plays and 154 sonnets."}
{"Date": "-1", "Claim": "Octopuses have three hearts and blue blood."}
{"Date": "-1", "Claim": "Exercise improves both physical and mental health."}
{"Date": "-1", "Claim": "Jupiter is the largest planet in the solar system."}
{"Date": "-1", "Claim": "Public transportation reduces traffic congestion in major cities."}
{"Date": "-1", "Claim": "Some people prefer digital books while others enjoy physical copies."}
{"Date": "-1", "Claim": "Honeybees communicate by performing a waggle dance."}
{"Date": "-1", "Claim": "The universe is estimated to be about 13.8 billion years old."}
{"Date": "-1", "Claim": "Climate change is causing an increase in extreme weather events."}
{"Date": "-1", "Claim": "Many languages evolve rapidly over time due to cultural change."}
{"Date": "-1", "Claim": "Whales are mammals, not fish."}
{"Date": "-1", "Claim": "Pluto was reclassified as a dwarf planet in 2006."}
{"Date": "-1", "Claim": "Some people find classical music relaxing and helpful for concentration."}
{"Date": "-1", "Claim": "The Amazon rainforest produces a large portion of the world's oxygen."}
{"Date": "-1", "Claim": "Bicycling is an environmentally friendly mode of transportation."}
{"Date": "-1", "Claim": "Dogs are capable of understanding hundreds of human words."}
{"Date": "-1", "Claim": "Human fingerprints are unique to each individual."}
{"Date": "-1", "Claim": "The Sahara Desert is the largest hot desert in the world."}
{"Date": "-1", "Claim": "Some people believe extraterrestrial life may exist elsewhere in the universe."}
{"Date": "-1", "Claim": "Electric vehicles produce no tailpipe emissions."}
{"Date": "-1", "Claim": "Antarctica is the coldest continent on Earth."}
{"Date": "-1", "Claim": "Reading fiction can increase empathy."}
{"Date": "-1", "Claim": "Fast food is often criticized for being unhealthy."}
{"Date": "-1", "Claim": "The human body contains 206 bones in adulthood."}
{"Date": "-1", "Claim": "Voting is considered a civic duty in many democratic societies."}
{"Date": "-1", "Claim": "Some people argue that technology has reduced face-to-face communication."}
{"Date": "-1", "Claim": "Spiders play an important role in controlling insect populations."}
{"Date": "-1", "Claim": "Quantum physics describes the behavior of very small particles."}
{"Date": "-1", "Claim": "Many cities are investing in green infrastructure to combat pollution."}
{"Date": "-1", "Claim": "The moon’s gravity affects Earth’s tides."}
{"Date": "-1", "Claim": "Some people consider chess a sport, while others classify it as a game."}
{"Date": "-1", "Claim": "Penguins cannot fly but are excellent swimmers."}
{"Date": "-1", "Claim": "Eating vegetables is associated with better long-term health."}
{"Date": "-1", "Claim": "The internet has transformed how people access information."}
